{
    "filename": "SPIT_Problem_Statement.pdf",
    "text": "problem\nstatement\nIN TODAY'S FAST-PACED WORLD, WHAT SHOULD BE THE SIMPLE\nTASK OF LOCATING A SPECIFIC PRODUCT IN A LOCAL STORE HAS\nTURNED INTO AN UNEXPECTED CHALLENGE FOR MANY\nSHOPPERS. WHETHER ONE IS LOOKING FOR THE PERFECT\nLAPTOP BAG, A SPECIFIC PHONE CHARGER, OR UNIQUE\nACCESSORIES, THE TYPICAL CONSUMER OFTEN FINDS HIMSELF\nIN THE MIDDLE OF A FRUSTRATING CYCLE OF VISITING MULTIPLE\nSTORES, MAKING PHONE CALLS, OR RELYING ON ONLINE\nSEARCHES THAT FAIL TO PROVIDE ACCURATE, LOCAL\nINFORMATION.\nTHIS DISCONNECTION BETWEEN BUYERS AND LOCAL RETAILERS\nCREATES A RIPPLE EFFECT THROUGHOUT COMMUNITIES, AND\nBUSINESSES MISS OPPORTUNITIES TO SERVE CUSTOMERS WHO\nARE ACTIVELY SEARCHING FOR THEIR PRODUCTS.\nA UNIFIED SYSTEM THAT BRIDGES THE GAP IN THE CURRENT\nLOCAL SHOPPING LANDSCAPE IS CURRENTLY ABSENT. E-\nCOMMERCE PLATFORMS HAVE REVOLUTIONIZED ONLINE\nSHOPPING BUT HAVE NOT ADDRESSED THE NEEDS OF\nCONSUMERS WHO WANT TO SHOP LOCALLY OR URGENTLY\nREQUIRE PRODUCTS.\nESPECIALLY THOSE SMALL BUSINESS OWNERS WITH OUT-OF-\nDATE INVENTORY SYSTEMS WHO LACK THE VISIBILITY OF THEIR\nPRODUCTS TO THE POTENTIAL CUSTOMERS LIVING IN THEIR\nVICINITY. IT IS MORE CHALLENGING FOR A DIVERSE COMMUNITY\nWHERE FAMILY-OWNED STORES USE TRADITIONAL SYSTEMS\nAND YET HAVE UNIQUE AND VALUABLE PRODUCTS.\nWE ENVISION A TRANSFORMATIVE SOLUTION THAT REIMAGINES\nLOCAL SHOPPING THROUGH A COMMUNITY-DRIVEN PLATFORM.\nTHIS PLATFORM WOULD USE REAL-TIME DATA AND CROWD-\nSOURCED UPDATES TO CREATE A DYNAMIC MARKETPLACE\nWHERE SHOPPERS CAN INSTANTLY LOCATE PRODUCTS IN\nNEARBY STORES. IT WOULD INCORPORATE FEATURES SUCH AS\nINVENTORY STATUS UPDATES, PRICE COMPARISONS, AND\nSTORE-SPECIFIC DETAILS TO EMPOWER CONSUMERS TO MAKE\nINFORMED DECISIONS BEFORE LEAVING THEIR HOMES.\nTHIS INITIATIVE GOES BEYOND MERE PRODUCT LOCATION – IT IS\nABOUT REVITALIZING LOCAL COMMERCE AND STRENGTHENING\nCOMMUNITY TIES. THE PLATFORM WOULD CREATE A TRUSTED\nECOSYSTEM THAT BENEFITS CONSUMERS AND RETAILERS BY\nENABLING FEATURES SUCH AS REAL-TIME AVAILABILITY\nALERTS, STORE RATINGS, AND PRODUCT REVIEWS FROM LOCAL\nSHOPPERS. THE SOLUTION WOULD SEAMLESSLY INTEGRATE\nWITH EXISTING SHOPPING HABITS WHILE INTRODUCING\nINNOVATIVE TOOLS THAT MAKE LOCAL SHOPPING MORE\nEFFICIENT AND ENJOYABLE.\nTHIS TRANSFORMATION OF THE TRADITIONAL SHOPPING\nEXPERIENCE INTO A STREAMLINED, COMMUNITY-FOCUSED\nSYSTEM THAT SAVES TIME FOR CONSUMERS AND DRIVES\nFOOTFALL INTO LOCAL BUSINESSES, CREATING A MORE\nVIBRANT AND SUSTAINABLE LOCAL ECONOMY. THE IDEA IS TO\nPRESERVE THE PERSONAL TOUCH IN LOCAL SHOPPING WHILE\nADDING THE CONVENIENCE AND EFFICIENCY THAT MODERN\nCONSUMERS EXPECT.\nWhat should be\nincluded?\nTHE FEATURES YOU PROPOSE: DESCRIBE THE FEATURE AND ITS\nPRIMARY FUNCTION. SPECIFY THE PROBLEM IT SOLVES AND THE\nTARGET AUDIENCE. EXPLAIN WHY THE FEATURE IS VALUABLE\nAND WHAT MAKES IT UNIQUE.\nHOW YOU WOULD IMPLEMENT THEM: OUTLINE THE TECH STACK\n(E.G., REACT FOR FRONTEND, NODE.JS FOR BACKEND,\nPOSTGRESQL FOR DATABASE) YOU WOULD USE. BREAK DOWN\nTHE IMPLEMENTATION PROCESS INTO KEY PHASES: PLANNING,\nDEVELOPMENT, TESTING, AND DEPLOYMENT. PROVIDE A ROUGH\nTIMELINE FOR EACH PHASE, MENTION THE RESOURCES\nREQUIRED. DISCUSS YOUR APPROACH .\nTHE IMPACT OF EACH FEATURE: EXPLAIN HOW THE FEATURE\nIMPROVES USER EXPERIENCE. HIGHLIGHT HOW IT ENHANCES\nFUNCTIONALITY AND USABILITY FOR THE END-USER.\nUSE OF GRAPHS AND INFORMATIONAL DIAGRAMS ARE\nPERMITTED, THEY CAN BE ADDED TO ENHANCE CLARITY AND\nCOMMUNICATION.",
    "requirements": [
        "probem",
        "statement",
        "spit",
        "hat",
        ""
    ]
}